#pragma once
/*本头文件为字模库，请把要显示的字模放入本文件中，注意 类型必须为const u8 否则报错！！*/
/*************取字方式 -- 共阴、列行式、逆向输出****************************/
/****注释前缀//   数据前缀0x    数据后缀,  行后缀,   其它自定义格式为空*********/

/************************************6*8的点阵************************************/
extern const unsigned char F6x8[][6];
/****************************************8*16的点阵************************************/
extern const unsigned char F8X16[];
/*************取字方式 -- 共阴、列行式、逆向输出****************************/
/****注释前缀//   数据前缀0x    数据后缀,  行后缀,   其它自定义格式为空*********/
extern const unsigned char F16x16[];
